app/controllers/blogs_controller.rb

def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "梅雨だ"], ["updated_at", "2018-06-14 01:41:54.553112"], ["id", 1]]